In [13]:
# 누락데이터 처리
import pandas as pd
import seaborn as sns

In [14]:
df = sns.load_dataset('titanic')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [9]:
# deck 컬럼의 값들의 갯수를 세어봄 df.value_counts(): 유니크한 값들의 갯수
print(df['deck'].value_counts())
print()
deck_cnt = df['deck'].value_counts(dropna = False) # NaN 데이터 세기
print(deck_cnt)
print()

# isnull() 메서드로 누락된 데이터 찾기, null 이면 True, 값이 있으면 False 반환
print(df['deck'].head().isnull())

# isnull()과 sum()함수를 이용하여 누락된 데이터 갯수 찾기
print(df['deck'].isnull().sum)
df.isnull().sum(axis=0) # age, deck, embarked, embark_town -> null data 포함

C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: deck, dtype: int64

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

0     True
1    False
2     True
3    False
4     True
Name: deck, dtype: bool
<bound method NDFrame._add_numeric_operations.<locals>.sum of 0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: deck, Length: 891, dtype: bool>

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [11]:
# 반복문으로 Nan 데이터 개수 계산하기
nan_data = df.isnull()
for col in nan_data.columns:
    nan_cnt = nan_data[col].value_counts() # 각 열의 Nan갯수 파악
    
    try:
        print(col, ':', nan_cnt[True]) # Nan 값이 존재하면 개수를 출력
    except:
        print(col, ':', 0) #Nan  값이 없으면 0을 출력
        
# Nan 데이터 확인 -> 어떻게 처리할것인지?
# Nan 데이터가 있는 컬럼을 삭제할것인지 / Nan 데이터가 있는 행을 삭제할 것인지

survived : 0
pclass : 0
sex : 0
age : 177
sibsp : 0
parch : 0
fare : 0
embarked : 2
class : 0
who : 0
adult_male : 0
deck : 688
embark_town : 2
alive : 0
alone : 0

In [21]:
# df.dropna() : axis = 1 열을 삭제, axis = 0 행을 삭제
# dropna() : Nan이 존재하는 컬럼을 삭제, 갯수가 500 이상인 컬럼만 삭제
df_thresh = df.dropna(axis=1, thresh=500)
df_thresh.info()

# age에 Nan이 존재하는 행을 삭제
df_age = df.dropna(subset=['age', 'embarked'], how='any', axis='index')
df_age.info()

# 컬럼 리스트 : Nan이 존재하는 컬럼리스트
nan_col = [df.isnull().sum()>0]
# Nan 이 존재하는 모든 행을 삭제
nan_col_names = df.columns[nan_col]
#nan_col_name
df_nan= df.dropna(subset=nan_col_names, how = 'any', axis=0)
df_nan.info()
df.isnull()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  embark_town  889 non-null    object
 12  alive        891 non-null    object
 13  alone        891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 79.4+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 712 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     712 non-null    int64
 1   pclass       712 non-null    int64
 2   sex          712 non-null    object
 3   age          712 non-null    float64
 4   sibsp        712 non-null    int64
 5   parch        712 non-null    int64
 6   fare         712 non-null    float64
 7   embarked     712 non-null    object
 8   class        712 non-null    category
 9   who          712 non-null    object
 10  adult_male   712 non-null    bool
 11  deck         182 non-null    category
 12  embark_town  712 non-null    object
 13  alive        712 non-null    object
 14  alone        712 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 70.0+ KB
<class 'pandas.core.frame.DataFrame'>
Int64Index: 182 entries, 1 to 889
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     182 non-null    int64
 1   pclass       182 non-null    int64
 2   sex          182 non-null    object
 3   age          182 non-null    float64
 4   sibsp        182 non-null    int64
 5   parch        182 non-null    int64
 6   fare         182 non-null    float64
 7   embarked     182 non-null    object
 8   class        182 non-null    category
 9   who          182 non-null    object
 10  adult_male   182 non-null    bool
 11  deck         182 non-null    category
 12  embark_town  182 non-null    object
 13  alive        182 non-null    object
 14  alone        182 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 18.2+ KB

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,True,False,False,False,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [26]:
sr= pd.Series([1,2,3,4,5])
sr_mask=[True, False, True, True, False]
sr[sr_mask]  # True만 셈, 또한 뒤에 .sum()을 붙이면 항목들을 더함

0    1
2    3
3    4
dtype: int64

In [27]:
df.columns[df.isnull().sum()>0] # Nan이 존재하는 컬럼명만 추출

Index(['age', 'embarked', 'deck', 'embark_town'], dtype='object')

In [33]:
# 누락 데이터 치환 : df.fillna(값 또는 mothod =ffill/bfill, inplace = True)
print(df['age'].isnull().sum()) # Nan이 존재함

#Nan이 입력된 age를 평균 나이로 치환
df_age = df.copy()
df_age['age'].fillna(df['age'].mean(axis=0), inplace=True)
df_age['age'].isnull().sum()
print(df['age'].head(), df_age['age'].head(10))

177
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64 0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
6    54.000000
7     2.000000
8    27.000000
9    14.000000
Name: age, dtype: float64

In [41]:
# 누락 데이터 치환
# embark_town 825~831 행 출력
# 가장 빈번하게 나오는 값으로 치환
df.embark_town[825:832]
df['embark_town'].value_counts().idxmax()# 가장 빈번하게 발생하는 인덱스명
df_em = df.copy()
df_em['embark_town'].fillna(df_em['embark_town'].value_counts().idxmax(), inplace=True)
df_em.embark_town[825:832]

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
830      Cherbourg
831    Southampton
Name: embark_town, dtype: object

In [52]:
# 누락 데이터 치환 : 이전 데이터로 치환
df=sns.load
df_me = df.copy()
df_me.embark_town.fillna(method = 'ffill', inplace = True)

print(df_me.embark_town[[828, 829]], '\n',df.embark_town[[828, 829]])

828    Queenstown
829    Queenstown
Name: embark_town, dtype: object
 828    Queenstown
829           NaN
Name: embark_town, dtype: object

In [61]:
# 중복 데이터 처리 : df.duplicated() -> 중복 여부 확인
df1 = pd.DataFrame( {'c1' : ['a', 'a', 'b', 'a', 'b'],
                    'c2' : [1,1,1,2,2],
                    'c3' : [1,1,2,2,2]})
print(df1)
df_dup = df1.duplicated()
col_dup = df1['c1'].duplicated()

# 중복된 데이터를 제거, 행을 제거
df2 = df1.drop_duplicates()
print(df2)

# 중복된 컬럼을 제거
df3 = df1.drop_duplicates(subset=['c2', 'c3'])
print(df3)

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2
  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2

In [15]:
# titanic 에서 age, fare, class, alive 컬럼만 가져와서 df_titanic으로 저장한 후
df_titanic = df.loc[:, ['age', 'fare', 'class', 'alive']]
df_titanic.head()

    age     fare  class alive
0  22.0   7.2500  Third    no
1  38.0  71.2833  First   yes
2  26.0   7.9250  Third   yes
3  35.0  53.1000  First   yes
4  35.0   8.0500  Third    no

In [16]:
df_titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     714 non-null    float64
 1   fare    891 non-null    float64
 2   class   891 non-null    category
 3   alive   891 non-null    object
dtypes: category(1), float64(2), object(1)
memory usage: 22.0+ KB

In [17]:
# Nan 있는 컬럼의 값의 숫자는 평균으로 문자는 이전 값으로 대체
for col in df_titanic.columns:
    if df_titanic[col].dtype == 'float64':
#        print("float64", col)
        df_titanic[col].fillna(df_titanic[col].mean(), inplace=True)
    else:
#        print("not float64", col)
        df_titanic[col].fillna(method='ffill', inplace = True)
df_titanic.head(6)
len(df_titanic)
# 중복된 행과 컬럼은 삭제하세요
df_titanic.drop_duplicates(inplace=True)
len(df_titanic)

746

In [18]:
df_titanic.drop_duplicates(subset=['age'], inplace=True)
len(df_titanic)

89

In [23]:
import pandas as pd

In [26]:
# dataset/ auto_mpg.csv
# 데이터 표준화
df = pd.read_csv('dataset/auto-mpg.csv',header=None)

# 컬럼 이름 지정
df.columns = ['mpg','cylinders','displacement','horsepower','weight',
              'acceleration','model year','origin','name']
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   name          398 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.1+ KB

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino

In [29]:
# 단위 환산 : mpg -> gallon => kg으로 변환
mpg_to_kg = 1.60934 / 3.78541
df['kpl'] = df['mpg']*mpg_to_kg
df.head(2)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model year,origin,name,kpl
0,7.652571,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3.253436
1,6.377143,8,350.0,165,3693,11.5,70,1,buick skylark 320,2.711197

In [36]:
# 자료형 변환 : object -> float 으로 변경
df['horsepower'].unique() # 중간에 '?' 발견 - > nan으로 변경, nan 처리함수 사용가능

array([130., 165., 150., 140., 198., 220., 215., 225., 190., 170., 160.,
        95.,  97.,  85.,  88.,  46.,  87.,  90., 113., 200., 210., 193.,
        nan, 100., 105., 175., 153., 180., 110.,  72.,  86.,  70.,  76.,
        65.,  69.,  60.,  80.,  54., 208., 155., 112.,  92., 145., 137.,
       158., 167.,  94., 107., 230.,  49.,  75.,  91., 122.,  67.,  83.,
        78.,  52.,  61.,  93., 148., 129.,  96.,  71.,  98., 115.,  53.,
        81.,  79., 120., 152., 102., 108.,  68.,  58., 149.,  89.,  63.,
        48.,  66., 139., 103., 125., 133., 138., 135., 142.,  77.,  62.,
       132.,  84.,  64.,  74., 116.,  82.])

In [37]:
import numpy as np
df['horsepower'].replace('?', np.nan, inplace = True)

In [38]:
# 데이터 타입을 float으로 변경
df['horsepower'] = df['horsepower'].astype('float')

In [46]:
# origin
df.origin.unique() # 숫자를 category로 변경 : 제조국 이름으로 변경
df.origin.replace({1:'USA', 2:'EU', 3: 'JPN'}, inplace = True)
df.origin.unique()

# object를 카테고리로 변경
df.origin = df.origin.astype('category')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    category
 8   name          398 non-null    object
 9   kpl           398 non-null    float64
dtypes: category(1), float64(5), int64(3), object(1)
memory usage: 28.6+ KB

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    category
 8   name          398 non-null    object
 9   kpl           398 non-null    float64
dtypes: category(1), float64(5), int64(3), object(1)
memory usage: 28.6+ KB

In [48]:
# 제조 년도 : model year -> 카테고리로 변경
df['model year'].unique()

array([70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], dtype=int64)

In [49]:
# 숫자를 문자로, 문자를 category로 변경(순서)
df['model year'] = df['model year'].astype('category')
df.info()
df['model year'].unique

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    category
 7   origin        398 non-null    category
 8   name          398 non-null    object
 9   kpl           398 non-null    float64
dtypes: category(2), float64(5), int64(2), object(1)
memory usage: 26.6+ KB

<bound method Series.unique of 0      70
1      70
2      70
3      70
4      70
       ..
393    82
394    82
395    82
396    82
397    82
Name: model year, Length: 398, dtype: category
Categories (13, int64): [70, 71, 72, 73, ..., 79, 80, 81, 82]>

In [ ]:
# 데이터 전처리
# 1. 누락 데이터 처리 : 제거, 치환
# 2. 중복 데이터 처리 : 제거(행), 컬럼..
# 3. 자료 표준화
#     1) 단위 환산
#     2) 자료형 변경 : object 를 float, object 를 category 로 등등
#        2-1) 변환 불가능한 자료는 NaN으로 치환하고 자료형 변경